[
  "What is the oldest impressionist artwork in the database?",
  "What is the newest painting in the database?",
  "What is the movement of the painting that depicts the highest number of swords?",
  "What is the movement of the painting that depicts the highest number of babies?",
  "What is the genre of the oldest painting in the database?",
  "What is the genre of the newest painting in the database?",
  "What is depicted on the oldest Renaissance painting in the database?",
  "What is depicted on the oldest religious artwork in the database?",
  "Plot the year of the oldest painting per movement",
  "Plot the year of the oldest painting per genre",
  "Plot the number of paintings that depict War for each year",
  "Plot the number of paintings that depict War for each century",
  "Plot the number of paintings for each year",
  "Plot the number of paintings for each century",
  "Plot the lowest number of swords depicted in each year",
  "Plot the lowest number of swords depicted in each genre",
  "Get the number of paintings that depict Fruit for each century",
  "Get the number of paintings that depict Animals for each movement",
  "Get the number of paintings for each year",
  "Get the number of paintings for each century",
  "Get the highest number of swords depicted in paintings of each movement",
  "Get the highest number of swords depicted in paintings of each genre",
  "Get the century of the newest painting per movement",
  "Get the century of the newest painting per genre",
  "Find the total number of paitings depicting war and number of painting depecting sword in Renaissance",
  "Retrieve the average number of paintings depicting a person and the total number of artworks depicting swords for each century.",
  "Create a plot displaying the count of paintings in each genre, as well as a plot showing the count of paintings in each movement",
  "Visualize the number of paintings corresponding to each century and Show the century of the most recent painting for each genre.",
  "Plot the total number of paintings depicting war and the number of paintings depicting swords in religious arts.",
  "Create a plot to display the number of paintings for each year and get the total number of paintings for each genre.",
  "Plot the number of religious art paintings by year",
  "Which religion is the most present in the database pictures?",
  "Can you create me a table that lists the titles of religious art pieces and their associated religions? Why did you assume the respective religion?",
  "Are there any pictures that appear more than once in the dataset? Give me the title names.",
  "Can you tell me which pictures have text in them? Print the text out and the picture number.",
  "Is there any depiction of a god in the picture img_18 (Christ of the mercy)? Why did you come to that conclusion that there is or isn't a god in this picture? Shortly explain your reasoning.",
  "Which pictures have nudity and what movement is it? Please give your answer in form of a table with the image number and movement on the right. Order them alphabetically per movement.",
  "In which pictures does a nude figure have eye contact with the viewer of the art piece? Give me the titles and the years they were made in table form, in order of appearance in the dataset.",
  "Give me all the names of the pictures where at least one gun is depicted.",
  "Which pictures show homosexuality? Give me their names.",
  "Plot the number of axe appearances for each genre. Show me the names of those images.",
  "Which century is the most represented?",
  "On what material was the art piece named \"Judith\" created?",
  "How many pictures display people with a darker skin-tone? Give me their names.",
  "Which painting is the newest religious art piece in the database?",
  "What images have at least one book in them? Give me their names in order of the img_path names.",
  "What images have trees in them? What are their names? Give your answer as a table with one row the title and another one the img_path.",
  "What images portray Napoleon? Give me the names of those images.",
  "What pictures portray Nelson Mandela? Give me their titles.",
  "Can you give me the titles of all images that have angels in them and give me their titles? Structure your answer in form of a table and order of appearance in the dataset.",
  "Can you give me the titles of all the paintings with at least one child that is not angel?",
  "What genre is most represented in which century? Plot me the result with all the most represented and the amount of pieces in the databse in form of a bar chart.",
  "What can you tell me about neoclassicism based on the images provided?",
  "Which pictures probably do not have their original name that the artist gave them in the database? What are they called?",
  "Can you give me the names of all the neoclassicism paintings that are also religious paintings? Why do you think you'll get this result?",
  "Which image is most representative of the saying: Memento Mori? Why?",
  "Can you give a title of any images, which belongs to the movement neoclassicism and also includes angels? Explain the result.",
  "Which genre dominates the 20th century according to our data set? Do you think that genre dominated that time? Justify your answer. "
]